
# tap repositories and their packages

tap 'homebrew/core'
brew 'adns'
brew 'aom'
brew 'assimp'
brew 'atk'
brew 'atkmm'
brew 'atkmm@2.28'
brew 'autoconf'
brew 'automake'
brew 'bdw-gc'
brew 'boost'
brew 'boost-build'
brew 'brotli'
brew 'c-ares'
brew 'cabextract'
brew 'cairo'
brew 'cairomm'
brew 'cairomm@1.14'
brew 'cjson'
brew 'cmake'
brew 'coreutils'
brew 'dav1d'
brew 'dbus'
brew 'docbook'
brew 'docbook-xsl'
brew 'double-conversion'
brew 'ffmpeg'
brew 'flac'
brew 'fontconfig'
brew 'fping'
brew 'freetype'
brew 'frei0r'
brew 'fribidi'
brew 'fx'
brew 'gd'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'geoipupdate'
brew 'gettext'
brew 'ghostscript'
brew 'giflib'
brew 'git'
brew 'glib'
brew 'glib-networking'
brew 'glibmm'
brew 'glibmm@2.66'
brew 'gmp'
brew 'gnu-getopt'
brew 'gnupg'
brew 'gnutls'
brew 'gobject-introspection'
brew 'gping'
brew 'gradle'
brew 'graphicsmagick'
brew 'graphite2'
brew 'graphviz'
brew 'gsettings-desktop-schemas'
brew 'gsl'
brew 'gtk+'
brew 'gtkmm'
brew 'gts'
brew 'guile'
brew 'haproxy'
brew 'harfbuzz'
brew 'hicolor-icon-theme'
brew 'htop'
brew 'i2util'
brew 'icu4c'
brew 'ilmbase'
brew 'imagemagick'
brew 'imath'
brew 'intltool'
brew 'iperf'
brew 'iperf3'
brew 'jasper'
brew 'jbig2dec'
brew 'jemalloc'
brew 'jpeg'
brew 'jq'
brew 'krb5'
brew 'lame'
brew 'leptonica'
brew 'libass'
brew 'libassuan'
brew 'libb2'
brew 'libbluray'
brew 'libcerf'
brew 'libde265'
brew 'libev'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgpg-error'
brew 'libheif'
brew 'libidn'
brew 'libidn2'
brew 'libksba'
brew 'liblqr'
brew 'libmaxminddb'
brew 'libogg'
brew 'libomp'
brew 'libpcap'
brew 'libpng'
brew 'libproxy'
brew 'libpsl'
brew 'libpthread-stubs'
brew 'librsvg'
brew 'libsamplerate'
brew 'libsigc++'
brew 'libsigc++@2'
brew 'libsmi'
brew 'libsndfile'
brew 'libsodium'
brew 'libsoup'
brew 'libsoxr'
brew 'libssh'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libunistring'
brew 'libusb'
brew 'libuv'
brew 'libvidstab'
brew 'libvorbis'
brew 'libvpx'
brew 'libwebsockets'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxrender'
brew 'libyaml'
brew 'little-cms'
brew 'little-cms2'
brew 'lua'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'mas'
brew 'mosquitto'
brew 'mpdecimal'
brew 'mysql'
brew 'mysql@5.6'
brew 'ncurses'
brew 'netpbm'
brew 'nettle'
brew 'nghttp2'
brew 'nmap'
brew 'node'
brew 'npth'
brew 'nspr'
brew 'nss'
brew 'oniguruma'
brew 'opencore-amr'
brew 'openexr'
brew 'openjdk'
brew 'openjpeg'
brew 'openssl@1.1'
brew 'opus'
brew 'p11-kit'
brew 'p7zip'
brew 'pango'
brew 'pangomm'
brew 'pangomm@2.46'
brew 'pcre'
brew 'pcre2'
brew 'pinentry'
brew 'pixman'
brew 'pkg-config'
brew 'plotutils'
brew 'poppler'
brew 'popt'
brew 'postgresql'
brew 'potrace'
brew 'protobuf'
brew 'pstoedit'
brew 'pyenv'
brew 'python@3.8'
brew 'python@3.9'
brew 'qt'
brew 'qt@5'
brew 'rav1e'
brew 'readline'
brew 'rtmpdump'
brew 'rubberband'
brew 'sdl2'
brew 'shared-mime-info'
brew 'siege'
brew 'six'
brew 'snappy'
brew 'speex'
brew 'sqlite'
brew 'srt'
brew 'tcl-tk'
brew 'telnet'
brew 'tesseract'
brew 'theora'
brew 'unbound'
brew 'unzip'
brew 'vala'
brew 'watch'
brew 'webp'
brew 'wget'
brew 'winetricks'
brew 'x264'
brew 'x265'
brew 'xmlto'
brew 'xorgproto'
brew 'xvid'
brew 'xz'
brew 'yarn'
brew 'youtube-dl'
brew 'zeromq'
brew 'zimg'
brew 'zlib'
brew 'zstd'

tap 'homebrew/bundle'

tap 'homebrew/cask-drivers'

tap 'homebrew/services'

tap 'homebrew/cask'
cask 'appcleaner'
cask 'authy'
cask 'cinebench'
cask 'copyq'
cask 'dbeaver-community'
cask 'discord'
cask 'disk-inventory-x'
cask 'dropbox'
cask 'google-chrome'
cask 'handbrake'
cask 'intel-power-gadget'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'maccpuid'
cask 'macfuse'
cask 'meld'
cask 'mockoon'
cask 'mounty'
cask 'obs'
cask 'packetsender'
cask 'phantomjs'
cask 'slack'
cask 'soundflower'
cask 'soundflowerbed'
cask 'spectacle'
cask 'unified-remote'
cask 'vagrant'
cask 'whatsapp'
cask 'wireshark'
cask 'xquartz'

tap 'boltopslabs/software'

tap 'buo/cask-upgrade'

tap 'gromgit/fuse'
brew 'ntfs-3g-mac'

tap 'heroku/brew'
brew 'heroku'
brew 'heroku-node'

tap 'martido/graph'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'shopify/shopify'

tap 'teamookla/speedtest'
brew 'speedtest'

# App Store applications
mas 'Clocker (21.03.01)', id: 1056643111
mas 'Discovery (2.0.3)', id: 1381004916
mas 'GarageBand (10.4.3)', id: 682658836
mas 'iMovie (10.2.4)', id: 408981434
mas 'Keynote (11.1)', id: 409183694
mas 'Microsoft Remote Desktop (10.6.7)', id: 1295203466
mas 'Monosnap (4.12.0)', id: 540348655
mas 'MQTT Explorer (0.3.5)', id: 1455214828
mas 'Numbers (11.1)', id: 409203825
mas 'Pages (11.1)', id: 409201541
mas 'Smart JSON Editor (1.4.5)', id: 1268962404
mas 'The Unarchiver (4.3.3)', id: 425424353
mas 'Todoist (7.7)', id: 585829637
mas 'Xcode (12.5.1)', id: 497799835
