
# tap repositories and their packages

tap 'homebrew/core'

tap 'homebrew/bundle'

tap 'homebrew/services'

tap 'homebrew/cask'

tap 'boltopslabs/software'

tap 'buo/cask-upgrade'

tap 'gromgit/fuse'
brew 'ntfs-3g-mac'
cask 'mounty'

tap 'heroku/brew'
brew 'heroku'
brew 'heroku-node'

tap 'kris-anderson/netperf'
brew 'netperf-enable-demo'

tap 'martido/graph'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'shopify/shopify'
brew 'yarn'
cask 'phantomjs'

tap 'teamookla/speedtest'
brew 'speedtest'

tap 'unused-code/formulae'
brew 'unused'

# Other Homebrew packages
brew 'abseil'
brew 'adns'
brew 'aom'
brew 'apr'
brew 'apr-util'
brew 'argon2'
brew 'aribb24'
brew 'aspell'
brew 'assimp'
brew 'atk'
brew 'atkmm'
brew 'atkmm@2.28'
brew 'autoconf'
brew 'automake'
brew 'bdw-gc'
brew 'boost'
brew 'boost-build'
brew 'brotli'
brew 'buf'
brew 'c-ares'
brew 'ca-certificates'
brew 'cabextract'
brew 'cairo'
brew 'cairomm'
brew 'cairomm@1.14'
brew 'cjson'
brew 'cmake'
brew 'cmocka'
brew 'coreutils'
brew 'curl'
brew 'dav1d'
brew 'dbus'
brew 'docbook'
brew 'docbook-xsl'
brew 'double-conversion'
brew 'duktape'
brew 'ffmpeg'
brew 'flac'
brew 'fontconfig'
brew 'freetds'
brew 'freetype'
brew 'frei0r'
brew 'fribidi'
brew 'fx'
brew 'gd'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'geoipupdate'
brew 'gettext'
brew 'ghostscript'
brew 'giflib'
brew 'git'
brew 'glib'
brew 'glib-networking'
brew 'glibmm'
brew 'glibmm@2.66'
brew 'gmp'
brew 'gnu-getopt'
brew 'gnupg'
brew 'gnutls'
brew 'gobject-introspection'
brew 'gpgme'
brew 'gping'
brew 'gradle'
brew 'graphicsmagick'
brew 'graphite2'
brew 'graphviz'
brew 'grep'
brew 'grpcurl'
brew 'gsettings-desktop-schemas'
brew 'gsl'
brew 'gtk+'
brew 'gtkmm'
brew 'gts'
brew 'guile'
brew 'haproxy'
brew 'harfbuzz'
brew 'hicolor-icon-theme'
brew 'highway'
brew 'htop'
brew 'hunspell'
brew 'i2util'
brew 'icu4c'
brew 'ilmbase'
brew 'imagemagick'
brew 'imath'
brew 'intltool'
brew 'iperf'
brew 'iperf3'
brew 'jasper'
brew 'jbig2dec'
brew 'jemalloc'
brew 'jpeg'
brew 'jpeg-turbo'
brew 'jpeg-xl'
brew 'jq'
brew 'jsoncpp'
brew 'krb5'
brew 'lame'
brew 'leptonica'
brew 'libarchive'
brew 'libass'
brew 'libassuan'
brew 'libavif'
brew 'libb2'
brew 'libbluray'
brew 'libcbor'
brew 'libcerf'
brew 'libde265'
brew 'libev'
brew 'libevent'
brew 'libffi'
brew 'libfido2'
brew 'libgcrypt'
brew 'libgit2'
brew 'libgit2@1.6'
brew 'libgpg-error'
brew 'libheif'
brew 'libidn'
brew 'libidn2'
brew 'libksba'
brew 'liblinear'
brew 'liblqr'
brew 'libmaxminddb'
brew 'libmng'
brew 'libnet'
brew 'libnghttp2'
brew 'libogg'
brew 'libomp'
brew 'libpcap'
brew 'libpng'
brew 'libpq'
brew 'libproxy'
brew 'libpsl'
brew 'libpthread-stubs'
brew 'libraw'
brew 'librist'
brew 'librsvg'
brew 'libsamplerate'
brew 'libsigc++'
brew 'libsigc++@2'
brew 'libsmi'
brew 'libsndfile'
brew 'libsodium'
brew 'libsoup'
brew 'libsoxr'
brew 'libssh'
brew 'libssh2'
brew 'libtasn1'
brew 'libtiff'
brew 'libtool'
brew 'libunibreak'
brew 'libunistring'
brew 'libusb'
brew 'libuv'
brew 'libvidstab'
brew 'libvmaf'
brew 'libvorbis'
brew 'libvpx'
brew 'libwebsockets'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxrender'
brew 'libyaml'
brew 'libzip'
brew 'little-cms2'
brew 'llvm'
brew 'llvm@16'
brew 'lua'
brew 'lua@5.3'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'mas'
brew 'mbedtls'
brew 'md4c'
brew 'miniupnpc'
brew 'mosquitto'
brew 'mpdecimal'
brew 'mpg123'
brew 'mysql'
brew 'namebench'
brew 'ncurses'
brew 'netpbm'
brew 'nettle'
brew 'nghttp2'
brew 'nmap'
brew 'node'
brew 'npth'
brew 'nspr'
brew 'nss'
brew 'oniguruma'
brew 'opencore-amr'
brew 'openexr'
brew 'openjdk'
brew 'openjdk@17'
brew 'openjpeg'
brew 'openldap'
brew 'openssl@1.1'
brew 'openssl@3'
brew 'opus'
brew 'p11-kit'
brew 'p7zip'
brew 'pango'
brew 'pangomm'
brew 'pangomm@2.46'
brew 'pcre'
brew 'pcre2'
brew 'php'
brew 'pinentry'
brew 'pipx'
brew 'pixman'
brew 'pkg-config'
brew 'plotutils'
brew 'poppler'
brew 'popt'
brew 'postgresql@14'
brew 'potrace'
brew 'protobuf'
brew 'protobuf@21'
brew 'pstoedit'
brew 'pyenv'
brew 'python-argcomplete'
brew 'python-certifi'
brew 'python-mutagen'
brew 'python-packaging'
brew 'python-setuptools'
brew 'python@3.10'
brew 'python@3.11'
brew 'python@3.12'
brew 'python@3.8'
brew 'python@3.9'
brew 'qt'
brew 'qt@5'
brew 'rav1e'
brew 'readline'
brew 'redis'
brew 'rtmpdump'
brew 'rubberband'
brew 'rust'
brew 'sdl2'
brew 'shared-mime-info'
brew 'siege'
brew 'six'
brew 'snappy'
brew 'speex'
brew 'sqlite'
brew 'srt'
brew 'svt-av1'
brew 'switchaudio-osx'
brew 'tcl-tk'
brew 'tcptraceroute'
brew 'telnet'
brew 'tesseract'
brew 'theora'
brew 'tidy-html5'
brew 'tldr'
brew 'unbound'
brew 'unixodbc'
brew 'unzip'
brew 'vala'
brew 'watch'
brew 'webp'
brew 'wget'
brew 'winetricks'
brew 'x264'
brew 'x265'
brew 'xmlto'
brew 'xorgproto'
brew 'xvid'
brew 'xz'
brew 'youtube-dl'
brew 'yt-dlp'
brew 'z3'
brew 'zeromq'
brew 'zimg'
brew 'zlib'
brew 'zstd'

# Other Cask applications
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'android-file-transfer'
cask 'angry-ip-scanner'
cask 'appcleaner'
cask 'arduino'
cask 'audacity'
cask 'authy'
cask 'caffeine'
cask 'chirp'
cask 'copyq'
cask 'dash'
cask 'dbeaver-community'
cask 'discord'
cask 'disk-inventory-x'
cask 'dropbox'
cask 'evernote'
cask 'firefox'
cask 'freecad'
cask 'garmin-express'
cask 'gimp'
cask 'google-chrome'
cask 'google-earth-pro'
cask 'grammarly'
cask 'handbrake'
cask 'inkscape'
cask 'insomnia'
cask 'istat-menus'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'lepton'
cask 'loom'
cask 'macfuse'
cask 'meld'
cask 'mockoon'
cask 'netspot'
cask 'ngrok'
cask 'obs'
cask 'obsidian'
cask 'openvpn-connect'
cask 'packetsender'
cask 'parsec'
cask 'permute'
cask 'pingplotter'
cask 'pop'
cask 'postman'
cask 'qbittorrent'
cask 'shotcut'
cask 'skype'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'sqlitestudio'
cask 'steam'
cask 'sublime-text'
cask 'teamviewer'
cask 'todoist'
cask 'transmission'
cask 'unified-remote'
cask 'vagrant'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'wine-stable'
cask 'wireshark'
cask 'xquartz'
cask 'zoom'

# App Store applications
mas 'Bitwarden (2023.8.3)', id: 1352778147
mas 'Boop (1.4.0)', id: 1518425043
mas 'Clocker (23.01)', id: 1056643111
mas 'Discovery (2.1.0)', id: 1381004916
mas 'Disk Space Analyzer (4.1.5)', id: 446243721
mas 'Home Assistant (2023.4)', id: 1099568401
mas 'iMovie (10.3.8)', id: 408981434
mas 'JoystickMonitor (1.3)', id: 1361339902
mas 'Keynote (13.1)', id: 409183694
mas 'Microsoft Remote Desktop (10.9.1)', id: 1295203466
mas 'Monosnap (6.1.0)', id: 540348655
mas 'MQTT Explorer (0.3.5)', id: 1455214828
mas 'Numbers (13.1)', id: 409203825
mas 'Pages (13.1)', id: 409201541
mas 'Quick Camera (1.4.3)', id: 598853070
mas 'ScreenBrush (1.8.7)', id: 1233965871
mas 'Smart JSON Editor (1.4.5)', id: 1268962404
mas 'stts (2.20)', id: 1187772509
mas 'The Unarchiver (4.3.5)', id: 425424353
mas 'Xcode (14.3.1)', id: 497799835
