
# tap repositories and their packages

tap 'homebrew/core'
brew 'abseil'
brew 'actionlint'
brew 'adns'
brew 'adwaita-icon-theme'
brew 'aften'
brew 'aom'
brew 'apr'
brew 'apr-util'
brew 'argocd'
brew 'argon2'
brew 'aribb24'
brew 'aspell'
brew 'assimp'
brew 'at-spi2-core'
brew 'autoconf'
brew 'automake'
brew 'aws-iam-authenticator'
brew 'aws-sso-util'
brew 'awscli'
brew 'bash'
brew 'bat'
brew 'bdw-gc'
brew 'berkeley-db@5'
brew 'boost'
brew 'boost-build'
brew 'brotli'
brew 'buf'
brew 'c-ares'
brew 'ca-certificates'
brew 'cabextract'
brew 'cairo'
brew 'cairomm'
brew 'cffi'
brew 'cjson'
brew 'cloudflared'
brew 'cmake'
brew 'cmocka'
brew 'colima'
brew 'coreutils'
brew 'cpm'
brew 'cppzmq'
brew 'cpu_features'
brew 'cryptography'
brew 'curl'
brew 'dav1d'
brew 'dbus'
brew 'direnv'
brew 'docbook'
brew 'docbook-xsl'
brew 'docker'
brew 'docker-buildx'
brew 'docker-completion'
brew 'docker-compose'
brew 'double-conversion'
brew 'duktape'
brew 'edencommon'
brew 'fb303'
brew 'fbthrift'
brew 'fd'
brew 'ffmpeg'
brew 'fftw'
brew 'fizz'
brew 'flac'
brew 'fmt'
brew 'folly'
brew 'fontconfig'
brew 'fping'
brew 'freetds'
brew 'freetype'
brew 'frei0r'
brew 'fribidi'
brew 'fx'
brew 'fzf'
brew 'gcc'
brew 'gd'
brew 'gdbm'
brew 'gdk-pixbuf'
brew 'geoipupdate'
brew 'gettext'
brew 'gflags'
brew 'gh'
brew 'ghostscript'
brew 'giflib'
brew 'git'
brew 'git-delta'
brew 'git-filter-repo'
brew 'glib'
brew 'glib-networking'
brew 'glibmm'
brew 'glog'
brew 'gmp'
brew 'gnu-getopt'
brew 'gnupg'
brew 'gnuradio'
brew 'gnutls'
brew 'go'
brew 'gobject-introspection'
brew 'gpgme'
brew 'gpgmepp'
brew 'gping'
brew 'gradle'
brew 'grafana'
brew 'granted'
brew 'graphicsmagick'
brew 'graphite2'
brew 'graphviz'
brew 'grep'
brew 'grpcurl'
brew 'gsettings-desktop-schemas'
brew 'gsl'
brew 'gtk+3'
brew 'gts'
brew 'guile'
brew 'gumbo-parser'
brew 'hackrf'
brew 'haproxy'
brew 'harfbuzz'
brew 'heroku'
brew 'hicolor-icon-theme'
brew 'highway'
brew 'htop'
brew 'hunspell'
brew 'hwloc'
brew 'i2util'
brew 'icu4c@76'
brew 'icu4c@77'
brew 'icu4c@78'
brew 'ijq'
brew 'imagemagick'
brew 'imath'
brew 'inspectrum'
brew 'intltool'
brew 'iperf'
brew 'iperf3'
brew 'isl'
brew 'jack'
brew 'jasper'
brew 'jbig2dec'
brew 'jemalloc'
brew 'jnv'
brew 'jpeg'
brew 'jpeg-turbo'
brew 'jpeg-xl'
brew 'jq'
brew 'jsoncpp'
brew 'k9s'
brew 'krb5'
brew 'kubectx'
brew 'kubernetes-cli'
brew 'lame'
brew 'leptonica'
brew 'libarchive'
brew 'libass'
brew 'libassuan'
brew 'libavif'
brew 'libb2'
brew 'libbluray'
brew 'libcerf'
brew 'libde265'
brew 'libdeflate'
brew 'libepoxy'
brew 'libev'
brew 'libevent'
brew 'libffi'
brew 'libgcrypt'
brew 'libgit2'
brew 'libgpg-error'
brew 'libheif'
brew 'libidn'
brew 'libidn2'
brew 'libksba'
brew 'liblinear'
brew 'liblqr'
brew 'libmaxminddb'
brew 'libmicrohttpd'
brew 'libmng'
brew 'libmpc'
brew 'libnet'
brew 'libnghttp2'
brew 'libnghttp3'
brew 'libngtcp2'
brew 'libogg'
brew 'libomp'
brew 'libpcap'
brew 'libpng'
brew 'libpq'
brew 'libproxy'
brew 'libpsl'
brew 'libpthread-stubs'
brew 'libraw'
brew 'librist'
brew 'librsvg'
brew 'librtlsdr'
brew 'libsamplerate'
brew 'libsigc++'
brew 'libsmi'
brew 'libsndfile'
brew 'libsodium'
brew 'libsoup'
brew 'libsoxr'
brew 'libssh'
brew 'libssh2'
brew 'libtasn1'
brew 'libtiff'
brew 'libtommath'
brew 'libtool'
brew 'libudfread'
brew 'libunibreak'
brew 'libunistring'
brew 'libusb'
brew 'libuv'
brew 'libvidstab'
brew 'libvmaf'
brew 'libvorbis'
brew 'libvpx'
brew 'libwebsockets'
brew 'libx11'
brew 'libxau'
brew 'libxcb'
brew 'libxdmcp'
brew 'libxext'
brew 'libxfixes'
brew 'libxi'
brew 'libxrender'
brew 'libxtst'
brew 'libyaml'
brew 'libzip'
brew 'lima'
brew 'liquid-dsp'
brew 'litehtml'
brew 'little-cms2'
brew 'llvm'
brew 'lua'
brew 'lz4'
brew 'lzo'
brew 'm4'
brew 'mas'
brew 'mbedtls'
brew 'md4c'
brew 'miniupnpc'
brew 'mono'
brew 'mosquitto'
brew 'mpdecimal'
brew 'mpfr'
brew 'mpg123'
brew 'mysql'
brew 'navi'
brew 'ncurses'
brew 'net-snmp'
brew 'netpbm'
brew 'nettle'
brew 'nghttp2'
brew 'nmap'
brew 'node'
brew 'node-build'
brew 'nodenv'
brew 'npth'
brew 'nspr'
brew 'nss'
brew 'numpy'
brew 'oniguruma'
brew 'open-mpi'
brew 'openblas'
brew 'opencore-amr'
brew 'openexr'
brew 'openjdk'
brew 'openjdk@17'
brew 'openjpeg'
brew 'openjph'
brew 'openldap'
brew 'openssl@1.1'
brew 'openssl@3'
brew 'opus'
brew 'orc'
brew 'overmind'
brew 'p11-kit'
brew 'p7zip'
brew 'pango'
brew 'pangomm'
brew 'pcre'
brew 'pcre2'
brew 'perl'
brew 'pgcli'
brew 'php'
brew 'pinentry'
brew 'pipx'
brew 'pixman'
brew 'pkg-config'
brew 'plotutils'
brew 'pmix'
brew 'poppler'
brew 'popt'
brew 'portaudio'
brew 'postgresql@14'
brew 'potrace'
brew 'pre-commit'
brew 'protobuf'
brew 'pstoedit'
brew 'py3cairo'
brew 'pycparser'
brew 'pyenv'
brew 'pygobject3'
brew 'pyqt'
brew 'pyqt@5'
brew 'python-argcomplete'
brew 'python-certifi'
brew 'python-packaging'
brew 'python@3.10'
brew 'python@3.11'
brew 'python@3.12'
brew 'python@3.13'
brew 'python@3.14'
brew 'python@3.9'
brew 'qt'
brew 'qt3d'
brew 'qt5compat'
brew 'qt@5'
brew 'qtbase'
brew 'qtcharts'
brew 'qtconnectivity'
brew 'qtdatavis3d'
brew 'qtdeclarative'
brew 'qtgraphs'
brew 'qtgrpc'
brew 'qthttpserver'
brew 'qtimageformats'
brew 'qtlanguageserver'
brew 'qtlocation'
brew 'qtlottie'
brew 'qtmultimedia'
brew 'qtnetworkauth'
brew 'qtpositioning'
brew 'qtquick3d'
brew 'qtquick3dphysics'
brew 'qtquickeffectmaker'
brew 'qtquicktimeline'
brew 'qtremoteobjects'
brew 'qtscxml'
brew 'qtsensors'
brew 'qtserialbus'
brew 'qtserialport'
brew 'qtshadertools'
brew 'qtspeech'
brew 'qtsvg'
brew 'qttools'
brew 'qttranslations'
brew 'qtvirtualkeyboard'
brew 'qtwebchannel'
brew 'qtwebengine'
brew 'qtwebsockets'
brew 'qtwebview'
brew 'qwt-qt5'
brew 'rav1e'
brew 'readline'
brew 'redis'
brew 'ripgrep'
brew 'rpds-py'
brew 'rtmpdump'
brew 'rubberband'
brew 'rust'
brew 'saml2aws'
brew 'sdl2'
brew 'shared-mime-info'
brew 'shellcheck'
brew 'siege'
brew 'simdjson'
brew 'six'
brew 'snappy'
brew 'soapyrtlsdr'
brew 'soapysdr'
brew 'spdlog'
brew 'speex'
brew 'sponge'
brew 'sqlite'
brew 'srt'
brew 'svt-av1'
brew 'switchaudio-osx'
brew 'tcl-tk'
brew 'tcptraceroute'
brew 'telnet'
brew 'temporal'
brew 'terraform-docs'
brew 'terragrunt'
brew 'tesseract'
brew 'tfenv'
brew 'tflint'
brew 'theora'
brew 'tidy-html5'
brew 'tldr'
brew 'tmux'
brew 'uhd'
brew 'unbound'
brew 'unixodbc'
brew 'unzip'
brew 'urh'
brew 'utf8proc'
brew 'uvwasi'
brew 'vala'
brew 'vale'
brew 'volk'
brew 'wangle'
brew 'watch'
brew 'watchman'
brew 'webp'
brew 'wget'
brew 'winetricks'
brew 'x264'
brew 'x265'
brew 'xmlto'
brew 'xorgproto'
brew 'xvid'
brew 'xxhash'
brew 'xz'
brew 'yamllint'
brew 'yarn'
brew 'yq'
brew 'yt-dlp'
brew 'z3'
brew 'zeromq'
brew 'zimg'
brew 'zlib'
brew 'zstd'

tap 'homebrew/cask'
cask 'adobe-creative-cloud'
cask 'alfred'
cask 'alt-tab'
cask 'altair-graphql-client'
cask 'android-file-transfer'
cask 'angry-ip-scanner'
cask 'antigravity'
cask 'appcleaner'
cask 'arduino-ide'
cask 'audacity'
cask 'authy'
cask 'balenaetcher'
cask 'betterdisplay'
cask 'blackhole-2ch'
cask 'caffeine'
cask 'chatgpt'
cask 'chirp'
cask 'cursor'
cask 'dash'
cask 'dbeaver-community'
cask 'discord'
cask 'disk-inventory-x'
cask 'dropbox'
cask 'eqmac'
cask 'evernote'
cask 'firefox'
cask 'freecad'
cask 'garmin-express'
cask 'gimp'
cask 'google-chrome'
cask 'google-earth-pro'
cask 'gstreamer-runtime'
cask 'handbrake'
cask 'inkscape'
cask 'insomnia'
cask 'istat-menus'
cask 'iterm2'
cask 'jetbrains-toolbox'
cask 'json-viewer'
cask 'karabiner-elements'
cask 'kicad'
cask 'labplot'
cask 'lepton'
cask 'loom'
cask 'macfuse'
cask 'meld'
cask 'mockoon'
cask 'mounty'
cask 'mqtt-explorer'
cask 'netspot'
cask 'ngrok'
cask 'notion'
cask 'obs'
cask 'obsidian'
cask 'openvpn-connect'
cask 'packetsender'
cask 'parsec'
cask 'permute'
cask 'phantomjs'
cask 'pingplotter'
cask 'pop'
cask 'postico'
cask 'postman'
cask 'qbittorrent'
cask 'qview'
cask 'rectangle'
cask 'rectangle-pro'
cask 'sigdigger'
cask 'skype'
cask 'slack'
cask 'soundflowerbed'
cask 'spotify'
cask 'sqlitestudio'
cask 'steam'
cask 'sublime-text'
cask 'teamviewer'
cask 'todoist'
cask 'tomatobar'
cask 'unified-remote'
cask 'visual-studio-code'
cask 'vlc'
cask 'whatsapp'
cask 'wine-stable'
cask 'wireshark'
cask 'xquartz'
cask 'zoom'

tap 'homebrew/bundle'

tap 'homebrew/services'

tap 'boltopslabs/software'

tap 'buo/cask-upgrade'

tap 'common-fate/granted'

tap 'gromgit/fuse'
brew 'ntfs-3g-mac'

tap 'heroku/brew'
brew 'heroku-node'

tap 'jondot/tap'
brew 'hygen'

tap 'kris-anderson/netperf'
brew 'netperf-enable-demo'

tap 'latticehr/lattice'
brew 'lattice-devenv'
brew 'lattice-helm@3.17.3'
brew 'lattice-moto'
brew 'lattice-node@20'
brew 'lattice-postgresql@15'

tap 'martido/graph'

tap 'matyf/local-tap'

tap 'rcmdnk/file'
brew 'brew-file'

tap 'shopify/shopify'

tap 'sqitchers/sqitch'
brew 'sqitch', args: ['with-postgres-support']

tap 'teamookla/speedtest'
brew 'speedtest'

tap 'unused-code/formulae'
brew 'unused'

# Other Homebrew packages
brew 'ilmbase'
brew 'lua@5.3'
brew 'python-mutagen'
brew 'python@3.8'

# Other Cask applications
cask 'grammarly'
cask 'namebench'

# App Store applications
mas 'Bitwarden (2025.11.2)', id: 1352778147
mas 'Boop (1.4.0)', id: 1518425043
mas 'Clocker (24.03)', id: 1056643111
mas 'Discovery (2.1.0)', id: 1381004916
mas 'GarageBand (10.4.12)', id: 682658836
mas 'Gifski (2.23.1)', id: 1351639930
mas 'Hex Fiend (2.15)', id: 1342896380
mas 'Home Assistant (2025.11.2)', id: 1099568401
mas 'iMovie (10.4.3)', id: 408981434
mas 'Keynote (14.4)', id: 409183694
mas 'Monosnap (6.36)', id: 540348655
mas 'Numbers (14.4)', id: 409203825
mas 'Pages (14.4)', id: 409201541
mas 'Pixea (8.0.1)', id: 1507782672
mas 'Say No to Notch (1.2.6)', id: 1639306886
mas 'Smart JSON Editor (1.4.5)', id: 1268962404
mas 'stts (3.0)', id: 1187772509
mas 'The Unarchiver (4.3.9)', id: 425424353
mas 'Xcode (26.2)', id: 497799835
